In [1]:
import pandas as pd
import numpy as np

In [2]:
data={'state':('orissa','maharashtra','tamil nadu'),'number':(54,99,43)}    #Primary way to make df is by dict of lists,tuples,arrays

In [3]:
pd.DataFrame(data)               #columns will be arranged in sorted order. To explicitly set the order,use it with columns=.. paramter

         state  number
0       orissa      54
1  maharashtra      99
2   tamil nadu      43

In [4]:
data={'state':np.arange(3),'number':[53,54,66]}        #dict of ndarray possible
pd.DataFrame(data)

   state  number
0      0      53
1      1      54
2      2      66

In [5]:
data1=[[1,2,3],[4,5,6]]       #list of list/tuples, also 2D ndarray
pd.DataFrame(data1,columns=['a','b','c'],index=['1st','2nd'])

     a  b  c
1st  1  2  3
2nd  4  5  6

In [6]:
df=pd.DataFrame(data,columns=['number','state','c','d','e'])

In [7]:
df.head()

   number  state    c    d    e
0      53      0  NaN  NaN  NaN
1      54      1  NaN  NaN  NaN
2      66      2  NaN  NaN  NaN

In [8]:
df.sample()

   number  state    c    d    e
1      54      1  NaN  NaN  NaN

In [9]:
df.tail()

   number  state    c    d    e
0      53      0  NaN  NaN  NaN
1      54      1  NaN  NaN  NaN
2      66      2  NaN  NaN  NaN

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   number  3 non-null      int64
 1   state   3 non-null      int32
 2   c       0 non-null      object
 3   d       0 non-null      object
 4   e       0 non-null      object
dtypes: int32(1), int64(1), object(3)
memory usage: 236.0+ bytes

In [11]:
df.describe()

          number  state
count   3.000000    3.0
mean   57.666667    1.0
std     7.234178    1.0
min    53.000000    0.0
25%    53.500000    0.5
50%    54.000000    1.0
75%    60.000000    1.5
max    66.000000    2.0

In [12]:
df.index.name='Sr.No'

In [13]:
df

       number  state    c    d    e
Sr.No
0          53      0  NaN  NaN  NaN
1          54      1  NaN  NaN  NaN
2          66      2  NaN  NaN  NaN

In [14]:
df.name='State with number'

In [15]:
df

       number  state    c    d    e
Sr.No
0          53      0  NaN  NaN  NaN
1          54      1  NaN  NaN  NaN
2          66      2  NaN  NaN  NaN

In [16]:
df.columns

Index(['number', 'state', 'c', 'd', 'e'], dtype='object')

In [17]:
df

       number  state    c    d    e
Sr.No
0          53      0  NaN  NaN  NaN
1          54      1  NaN  NaN  NaN
2          66      2  NaN  NaN  NaN

In [18]:
df['state']

Sr.No
0    0
1    1
2    2
Name: state, dtype: int32

In [19]:
c=df.columns.tolist()

In [20]:
c

['number', 'state', 'c', 'd', 'e']

In [21]:
c=c[2:]+c[:2]

In [22]:
c

['c', 'd', 'e', 'number', 'state']

In [23]:
df.columns=c

In [24]:
df

        c  d    e number state
Sr.No
0      53  0  NaN    NaN   NaN
1      54  1  NaN    NaN   NaN
2      66  2  NaN    NaN   NaN

In [25]:
a=[i for i in df['d']]
val=pd.Series(a)

In [26]:
df['e']=val

In [27]:
df

        c  d  e number state
Sr.No
0      53  0  0    NaN   NaN
1      54  1  1    NaN   NaN
2      66  2  2    NaN   NaN

In [28]:
df['number']=[i for i in df['d']]

In [29]:
df

        c  d  e  number state
Sr.No
0      53  0  0       0   NaN
1      54  1  1       1   NaN
2      66  2  2       2   NaN

In [30]:
df['state']=np.random.randn(3)

In [31]:
df

        c  d  e  number     state
Sr.No
0      53  0  0       0  1.513322
1      54  1  1       1  0.808959
2      66  2  2       2  0.207394

In [32]:
#so,we can include a column by list,series or ndarray

In [33]:
#Common arguments in DataFrame constructor:

In [34]:
data={'India':{'2000':1.6,'2001':4.5},'America':{'2000':5.4,'2009':9.0}}

df=pd.DataFrame(data)             #argument:dict of dicts. Outer keys act as column labels,inner keys act as row labels

In [35]:
df.columns.name='country'
df.index.name='year'
df.name='Table'
df

country  India  America
year
2000       1.6      5.4
2001       4.5      NaN
2009       NaN      9.0

In [36]:
df.isnull()

country  India  America
year
2000     False    False
2001     False     True
2009      True    False